# PaperSize Properties

---
The PaperSize type exposes the following members.
| Name| Description
---|---|---
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Name|  Retrieve the paper size name of current project.
Top
#### Reference
PaperSize Class
Autodesk.Revit.DB Namespace